Repository: nlhomme/MorseModem
Catalog: MorseModem/Localizable.xcstrings
Source language: en
Languages: fr

source: %lld characters
fr: %lld caractères

source: %lld percent
fr: %lld pour cent

source: %lld words per minute
fr: %lld mots par minute

source: %lld WPM
fr: %lld MPM

source: About
fr: À propos

source: Acknowledgements
fr: Remerciements

source: Are you sure you want to delete all %lld messages? This action cannot be undone.
fr: Voulez-vous vraiment supprimer les %lld messages ? Cette action est irréversible.

source: Audio file has been exported successfully.
fr: Le fichier audio a été exporté avec succès.

source: Audio Level
fr: Niveau audio

source: Audio Settings
fr: Réglages audio

source: Calculated based on current speed setting (WPM)
fr: Calculé en fonction du réglage de vitesse actuel (MPM)

source: Cancel
fr: Annuler

source: Character Gap
fr: Espace entre caractères

source: Clear
fr: Effacer

source: Clear All
fr: Tout supprimer

source: Clear All History
fr: Supprimer tout l'historique

source: Clear Results
fr: Effacer les résultats

source: Clears the decoded Morse code and text
fr: Efface le code Morse et le texte décodés

source: Clears the input text and Morse code
fr: Efface le texte saisi et le code Morse

source: Copied
fr: Copié

source: Copied to clipboard
fr: Copié dans le presse-papiers

source: Copies the decoded text to clipboard
fr: Copie le texte décodé dans le presse-papiers

source: Copies the Morse code to clipboard
fr: Copie le code Morse dans le presse-papiers

source: Copy
fr: Copier

source: Copy decoded text
fr: Copier le texte décodé

source: Copy Morse code
fr: Copier le code Morse

source: Copy text
fr: Copier le texte

source: Current Settings
fr: Réglages actuels

source: Dash Duration
fr: Durée du trait

source: Decode Morse Code
fr: Décoder le code Morse

source: Decoded
fr: Décodé

source: Decoded Message
fr: Message décodé

source: Decoded Morse Code
fr: Code Morse décodé

source: Decoded Text
fr: Texte décodé

source: Decoder
fr: Décodeur

source: Developer
fr: Développeur

source: Done
fr: Terminé

source: Dot Duration
fr: Durée du point

source: Encoded
fr: Encodé

source: Encoded Message
fr: Message encodé

source: Encoder
fr: Encodeur

source: Enter your message
fr: Entrez votre message

source: Export Audio
fr: Exporter l'audio

source: Export audio file
fr: Exporter le fichier audio

source: Export Successful
fr: Export réussi

source: Exports the Morse code as an audio file to share
fr: Exporte le code Morse sous forme de fichier audio à partager

source: Failed to import audio file: %@
fr: Échec de l'importation du fichier audio : %@

source: History
fr: Historique

source: Import audio file
fr: Importer un fichier audio

source: Import Audio File
fr: Importer un fichier audio

source: Import complete. Decoded text is ready.
fr: Importation terminée. Le texte décodé est prêt.

source: Import complete. No Morse code detected.
fr: Importation terminée. Aucun code Morse détecté.

source: Import Error
fr: Erreur d'importation

source: Import failed.
fr: Échec de l'importation.

source: Importing and decoding audio...
fr: Importation et décodage de l'audio...

source: Legal
fr: Légal

source: Letters
fr: Lettres

source: Listening for audio...
fr: Écoute de l'audio...

source: Message Details
fr: Détails du message

source: Microphone access is required to record Morse code. Please enable it in Settings.
fr: L'accès au microphone est nécessaire pour enregistrer du code Morse. Veuillez l'activer dans les Réglages.

source: Morse Code
fr: Code Morse

source: Morse Reference
fr: Référence Morse

source: No History
fr: Aucun historique

source: Numbers
fr: Chiffres

source: Opens a file picker to select an audio file for Morse code decoding
fr: Ouvre un sélecteur de fichier pour choisir un fichier audio à décoder

source: OR
fr: OU

source: Permission Required
fr: Autorisation requise

source: Play morse code
fr: Jouer le code Morse

source: Play Morse Code
fr: Jouer le code Morse

source: Play morse code for %@
fr: Jouer le code Morse pour %@

source: Plays the encoded Morse code as audio
fr: Joue le code Morse encodé en audio

source: Privacy Policy
fr: Politique de confidentialité

source: Punctuation
fr: Ponctuation

source: Record audio with your microphone or import an audio file containing Morse code.
fr: Enregistrez de l'audio avec votre microphone ou importez un fichier audio contenant du code Morse.

source: RECORDING
fr: ENREGISTREMENT

source: Recording started
fr: Enregistrement démarré.

source: Recording stopped. Decoded text is ready.
fr: Enregistrement arrêté. Le texte décodé est prêt.

source: Recording stopped. No Morse code detected.
fr: Enregistrement arrêté. Aucun code Morse détecté.

source: Reference
fr: Référence

source: Reset to Defaults
fr: Réinitialiser par défaut

source: Search characters
fr: Rechercher des caractères

source: Search messages
fr: Rechercher des messages

source: Settings
fr: Réglages

source: Speak or play Morse code near your device
fr: Parlez ou jouez du code Morse près de votre appareil

source: Speed
fr: Vitesse

source: Speed: Words per minute (5-40 WPM)
fr: Vitesse : Mots par minute (5-40 MPM)

source: Start recording
fr: Démarrer l'enregistrement

source: Start Recording
fr: Démarrer l'enregistrement

source: Starts capturing audio to decode Morse code
fr: Démarre la capture audio pour décoder le code Morse

source: Stop playing
fr: Arrêter la lecture

source: Stop recording
fr: Arrêter l'enregistrement

source: Stop Recording
fr: Arrêter l'enregistrement

source: Stops the audio playback
fr: Arrête la lecture audio

source: Stops the current audio capture
fr: Arrête la capture audio en cours

source: Text
fr: Texte

source: Text copied to clipboard
fr: Texte copié dans le presse-papiers

source: Text input field
fr: Champ de saisie de texte

source: Text to Encode
fr: Texte à encoder

source: Thank you to all the open-source contributors and the Swift community for making this project possible. Thank you Baptiste Leterrier for your support, you’re the best friend ever. Thank you Claude Code for quickly vide code this project
fr: Merci à tous les contributeurs open source et à la communauté Swift d'avoir rendu ce projet possible. Merci Baptiste Leterrier pour ton soutien, t’es le meilleur ami de tous les temps. Merci Claude Code pour le codage rapide de ce projet

source: Timing Information
fr: Informations de temporisation

source: Tone Frequency
fr: Fréquence du son

source: Tone Frequency: Adjust the pitch of the Morse code beep (300-1500 Hz)
fr: Fréquence du son : Ajustez la hauteur du bip du code Morse (300-1500 Hz)

source: Volume: Playback volume (0-100%)
fr: Volume : Volume de lecture (0-100 %)

source: Website
fr: Site Web

source: Word Gap
fr: Espace entre mots

source: Your encoded and decoded messages will appear here
fr: Vos messages encodés et décodés apparaîtront ici
